// Є змінна х, якій ви надаєте довільне числове значення.
// Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let x = +prompt('Введіть число');
if (x !== 0) {
    console.log('Вірно')
} else {
    console.log('Невірно')
}

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
let time = +prompt('Введіть число від 0 до 59');

if (time >= 0 && time <= 15) {
    console.log(`Число ${time} попадає в першу четверть години!`);
} else if (time > 15 && time <= 30) {
    console.log(`Число ${time} попадає в другу четверть години!`)
} else if (time > 30 && time <= 45) {
    console.log(`Число ${time} попадає в третю четверть години!`)
} else if (time > 45 && time <= 59) {
    console.log(`Число ${time} попадає в четверту четверть години!`);
} else console.log('Ви ввели невірне число!!!');

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
let day = +prompt('Введіть число від 1 до 31');

if (day >= 1 && day <= 15) {
    console.log(`Число ${day} попадає в першу декаду місяця.`);
} else if (day > 15 && day <= 31) {
    console.log(`Число ${day} попадає в другу декаду місяця.`);
} else console.log('Ви ввели невірне число!!!');


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
let dayNumber = +prompt('Введіть порядковий номер дня тижня');

switch (dayNumber) {
    case 1:
        console.log('Monday');
        break;
    case 2:
        console.log('Tuesday');
        break;
    case 3:
        console.log('Wednesday');
        break;
    case 4:
        console.log('Thursday');
        break;
    case 5:
        console.log('Friday');
        break;
    case 6:
        console.log('Saturday');
        break;
    case 7:
        console.log('Sunday');
        break;
    default:
        console.log(`${dayNumber} дня тижня немає.`);

}


//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.


let a = +prompt('Введіть число a');
let b = +prompt('Введіть число b');
let max;
if (a >= !b) {
    max = b;
} else if (b <= !a) {
    max = a;
} else console.log('Ви не ввели нічого');
console.log(max);


//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
x = prompt('введіть x') || 'default';
console.log(x);


